Callum-Sinclair/nrf51_pi_house_monitor/nrf_pi_extention/BLE_central/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

void connections_log_init(void)
{
    for (uint8_t i = 0; i < NUM_TEMP_DEVS; i++)
    {
        m_conn_handle_c[i] = BLE_CONN_HANDLE_INVALID;
        dev_connected[i]   = false;
    }    
}

bool debug_trigger(void)
{
    if (NRF_GPIO->IN & DEBUG_PIN_MASK)
    {
        return false;
    }
    else
    {
        return true;
    }
}

void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
      {
          10,
          9,
          RTS_PIN_NUMBER,
          RTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud9600
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_evt_handler,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);
    APP_ERROR_CHECK(err_code);
}

void temp_array_init(void)
{
    for (uint8_t i = 0; i < NUM_TEMP_DEVS; i++)
    {
        latest_temp[i].id = 0xff;
        latest_temp[i].conn_hand = BLE_CONN_HANDLE_INVALID;
    }
}
/** @brief Function to sleep until a BLE event is received by the application.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
    if (indicate < 10)
    {
        indicate_dev(indicate);
        indicate = 0xff;
    }
}


int main(void)
{
    ret_code_t err_code;
    bool       erase_bonds;

    //err_code = NRF_LOG_INIT();
    //APP_ERROR_CHECK(err_code);

    //NRF_LOG_PRINTF("Relay Example\r\n");

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
    // Create uart timer
    err_code = app_timer_create(&m_uart_tx_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                uart_tx_timeout_handler);
    APP_ERROR_CHECK(err_code);
    
    err_code = app_timer_start(m_uart_tx_timer_id, UART_TX_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
    
    connections_log_init();
    indicate_led_init();
    indicate_led_on();
    debug_pin_init();
    temp_array_init();
    uart_init();

    ble_stack_init();

    peer_manager_init(erase_bonds);

    db_discovery_init();
    rscs_c_init();

    gap_params_init();
    conn_params_init();
    services_init();
    advertising_init();

    /** Start scanning for peripherals and initiate connection to devices which
     *  advertise Heart Rate or Running speed and cadence UUIDs. */
    scan_start();


    // Start advertising.
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    app_uart_put(0);
    for (;;)
    {
        //uart_tx_temps();
        //nrf_delay_ms(10);
        // Wait for BLE events.
        power_manage();
    }
}
